NextFOAM-2401/tutorials/combustion/fireFoam/LES/simplePMMApanel/system/panelRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default        none;
}

laplacianSchemes
{
    default         none;

    laplacian(kappa,T)  Gauss harmonic uncorrected;
    laplacian(thermo:alpha,h)  Gauss harmonic uncorrected;
    laplacian(kappa,T) Gauss harmonic uncorrected;
}

interpolationSchemes
{
    default         linear;
    interpolate(K)  harmonic;
}

snGradSchemes
{
    default        uncorrected;
}


// ************************************************************************* //
